[
  {
    "id": "1",
    "date": "2025-07-22",
    "title": "Guidance & UI Enhancements",
    "content": [
      "Added in-app documentation to guide users through key features.",
      "Linked app tutorials to the official YouTube page for video walkthroughs.",
      "Published a development roadmap to share upcoming features and plans.",
      "Improved the UI of various in-app features for better user experience.",
      "Fixed bugs and applied minor stability improvements."
    ],
    "media": [
      {
        "type": "image",
        "url": "https://res.cloudinary.com/dqxtf297o/image/upload/v1753185421/artshare-asset/app-updates/ArtShare_1.5.2_kxvq9d.png"
      }
    ],
    "version": "v1.5.2"
  },
  {
    "id": "2",
    "date": "2025-07-10",
    "title": "UI Refresh & Feature Improvements",
    "content": [
      "Updated the overall app layout with a new sidebar and improved page hierarchy.",
      "Enhanced the image editor with more user controls and editing options.",
      "Refined the layout of several in-app features for better usability.",
      "Improved the automation feature for smoother post scheduling and management.",
      "Fixed bugs and made minor performance optimizations."
    ],
    "media": [
      {
        "type": "image",
        "url": "https://res.cloudinary.com/dqxtf297o/image/upload/v1753185421/artshare-asset/app-updates/ArtShare_1.4.4_uy3rqm.png"
      }
    ],
    "version": "v1.4.4"
  },
  {
    "id": "3",
    "date": "2025-06-29",
    "title": "AI Enhancements & System Upgrades",
    "content": [
      "Improved AI generation with new features like prompt suggestions and trending AI post exploration.",
      "Added a rich text editor for composing and editing posts with more control.",
      "Introduced a blog-style Explore page to browse long-form content and updates.",
      "Introduced subscription system with user roles and plan management.",
      "Added a new feature for automating post scheduling and publishing.",
      "Enhanced the admin dashboard to support AI tools and subscription controls.",
      "Fixed various bugs and improved overall app stability."
    ],
    "media": [
      {
        "type": "image",
        "url": "https://res.cloudinary.com/dqxtf297o/image/upload/v1753185421/artshare-asset/app-updates/ArtShare_1.3.6_g3ddhm.png"
      }
    ],
    "version": "v1.3.6"
  },
  {
    "id": "4",
    "date": "2025-05-31",
    "title": "Major Features & Improvements",
    "content": [
      "Introduced a new app dashboard for better user navigation and overview.",
      "Launched AI-powered art generation for creating images from custom prompts.",
      "Added a basic image editor for quick in-browser adjustments.",
      "Enabled users to edit their existing posts directly.",
      "Enabled direct uploads of AI-generated images to the platform.",
      "Improved the authentication flow and onboarding experience.",
      "Introduced in-app notifications for user activity and updates.",
      "Added a reporting feature to flag inappropriate content.",
      "Released an admin dashboard to manage users, posts, and reports."
    ],
    "media": [
      {
        "type": "image",
        "url": "https://res.cloudinary.com/dqxtf297o/image/upload/v1753185421/artshare-asset/app-updates/ArtShare_1.2.0_jicl1z.png"
      }
    ],
    "version": "v1.2.0"
  },
  {
    "id": "5",
    "date": "2025-04-15",
    "title": "Feature Expansion",
    "content": [
      "Redesigned the Explore page layout and added category-based filters.",
      "Added a new search feature to quickly find posts and users.",
      "Introduced interactive features including like, comment, share, and bookmark.",
      "Users can now upload image posts directly from their own devices.",
      "Added the ability to create and manage personal collections of saved posts.",
      "Added user profile pages displaying uploaded posts, collections."
    ],
    "media": [
      {
        "type": "image",
        "url": "https://res.cloudinary.com/dqxtf297o/image/upload/v1753185421/artshare-asset/app-updates/ArtShare_1.1.0_kqfkmd.png"
      }
    ],
    "version": "v1.1.0"
  },
  {
    "id": "6",
    "date": "2025-03-12",
    "title": "Initial Release Highlights",
    "content": [
      "Set up the core project structure with essential configuration.",
      "Added user login, registration, and basic access control.",
      "Built the main layout with header, sidebar, and content areas.",
      "Introduced a basic explore page for browsing content."
    ],
    "media": [
      {
        "type": "image",
        "url": "https://res.cloudinary.com/dqxtf297o/image/upload/v1753185421/artshare-asset/app-updates/ArtShare_1.0.0_hmej9s.png"
      }
    ],
    "version": "v1.0.1"
  },
  {
    "id": "7",
    "date": "2025-03-01",
    "title": "Our journey begins",
    "content": [],
    "media": [],
    "version": "v1.0.0"
  }
]
